In [20]:
import pandas as pd

df = pd.DataFrame(columns=['Name', 'Type'])
df.head()

Empty DataFrame
Columns: [Name, Type]
Index: []

In [25]:
##Inputs##
# 'int','INTEGER'
# 'myFunction','FUNCTION'
# 'x','ID'
# '5','NUM'
# '7', 'num'

name = '5'
typ = 'NUM'

if name not in df.Name.values:
    df.loc[-1] = [name, typ]
    df.index = df.index + 1
    df = df.sort_index()



df

         Name      Type
0           5       NUM
1           x        ID
2  myFunction  FUNCTION
3         int   INTEGER
4           7       num

In [27]:
#Search by name

name='int'
df.loc[df['Name'] == name]

  Name     Type
3  int  INTEGER

In [28]:
##Delete by name

name='int'

try:
    idx = df.loc[df['Name'] == name].index[0]
    df.drop([idx],axis=0,inplace=True)
    df.reset_index(inplace=True)
    df.drop('index',axis=1,inplace=True)

except:
    print('Name not found')



df

         Name      Type
0           5       NUM
1           x        ID
2  myFunction  FUNCTION
3           7       num

In [29]:
# Show table
df

         Name      Type
0           5       NUM
1           x        ID
2  myFunction  FUNCTION
3           7       num

In [30]:
# Update by name.

old_name='7'
new_name='9'


if old_name:
    if old_name in df.Name.values:
        df.loc[df.Name == old_name,'Name'] = new_name

df

         Name      Type
0           5       NUM
1           x        ID
2  myFunction  FUNCTION
3           9       num

In [31]:
## Find location by name

name='9'
df.loc[df['Name'] == name].index[0]

3